---
kind: method
id: M:Autodesk.Revit.DB.IFCExportOptions.#ctor(Autodesk.Revit.DB.IFCExportOptions)
source: html/6ce86909-8c0f-a1e1-bdb8-0d8cdc23dc80.htm
---
# Autodesk.Revit.DB.IFCExportOptions.#ctor Method

Creates a copy of an IFCExportOptions.

## Syntax (C#)
```csharp
public IFCExportOptions(
	IFCExportOptions from
)
```

## Parameters
- **from** (`Autodesk.Revit.DB.IFCExportOptions`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null